# 这是系统的主程序
# 　　　　　　　 ┏┓       ┏┓+ +
# 　　　　　　　┏┛┻━━━━━━━┛┻┓ + +
# 　　　　　　　┃　　　　　　 ┃
# 　　　　　　　┃　　　━　　　┃ ++ + + +
# 　　　　　　 █████━█████  ┃+
# 　　　　　　　┃　　　　　　 ┃ +
# 　　　　　　　┃　　　┻　　　┃
# 　　　　　　　┃　　　　　　 ┃ + +
# 　　　　　　　┗━━┓　　　 ┏━┛
#                ┃　　  ┃
# 　　　　　　　　　┃　　  ┃ + + + +
# 　　　　　　　　　┃　　　┃　Code is far away from     bug with the animal protecting
# 　　　　　　　　　┃　　　┃ + 　　　　         神兽保佑,代码无bug
# 　　　　　　　　　┃　　　┃
# 　　　　　　　　　┃　　　┃　　+
# 　　　　　　　　　┃　 　 ┗━━━┓ + +
# 　　　　　　　　　┃ 　　　　　┣┓
# 　　　　　　　　　┃ 　　　　　┏┛
# 　　　　　　　　　┗┓┓┏━━━┳┓┏┛ + + + +
# 　　　　　　　　　 ┃┫┫　 ┃┫┫
# 　　　　　　　　　 ┗┻┛　 ┗┻┛+ + + +

# 导入自定义模块
import showMain


# 这是一个主函数
def main():
    showMain.choiceClient()

# 程序执行入口
main()

'''
项目进度:
    2018/2/8:
        1.完成主函数的编写
        2.完成展示界面的编写
        3.完成教师类和学生类的编写
        4.完成教师的注册和登录函数编写
        5.完成添加学生基本信息,查看学生基本信息,删除学生基本信息,修改学生基本信息的编写
    2018/2/9
        1.完成学生登录模块的编写
        2.完成学生端查询学生基本信息的编写
        3.初步完成对课程类的编写
        4.初步完成添加课程表的操作
    2018/2/10
        1.完成对选课模块的编写
        2.完成对课程类的编写
        3.完成对添加课程表的编写
        4.完成对生成日志文件的编写
        5.完成对添加学生成绩,查找学生成绩的编写
    2018/2/11
        1.完成对删除学生成绩,修改学生成绩的编写
        2.完成学生端查询学生成绩的编写
'''
